//Startup Configuration
Switch>enable
Switch#configure terminal
Switch(config)#hostname GB-CA-L3S1_DL

//Vlan Configuration
GB-CA-L3S1_DL(config)#vlan 8
GB-CA-L3S1_DL(config-vlan)#name security
GB-CA-L3S1_DL(config-vlan)#vlan 16
GB-CA-L3S1_DL(config-vlan)#name it
GB-CA-L3S1_DL(config-vlan)#vlan 24
GB-CA-L3S1_DL(config-vlan)#name finance
GB-CA-L3S1_DL(config-vlan)#vlan 32
GB-CA-L3S1_DL(config-vlan)#name hr
GB-CA-L3S1_DL(config-vlan)#vlan 36
GB-CA-L3S1_DL(config-vlan)#name management
GB-CA-L3S1_DL(config-vlan)#vlan 40
GB-CA-L3S1_DL(config-vlan)#name native

//Switchports VLAN Assignment
GB-CA-L3S1_DL(config)#interface fastEthernet 0/1
GB-CA-L3S1_DL(config-if)#switchport mode access
GB-CA-L3S1_DL(config-if)#switchport access vlan 8
GB-CA-L3S1_DL(config-if)#exit
GB-CA-L3S1_DL(config)#interface fastEthernet 0/2
GB-CA-L3S1_DL(config-if)#switchport mode access
GB-CA-L3S1_DL(config-if)#switchport access vlan 16
GB-CA-L3S1_DL(config-if)#exit
GB-CA-L3S1_DL(config)#interface fastEthernet 0/3
GB-CA-L3S1_DL(config-if)#switchport mode access
GB-CA-L3S1_DL(config-if)#switchport access vlan 24
GB-CA-L3S1_DL(config-if)#exit
GB-CA-L3S1_DL(config)#interface fastEthernet 0/4
GB-CA-L3S1_DL(config-if)#switchport mode access
GB-CA-L3S1_DL(config-if)#switchport access vlan 32
GB-CA-L3S1_DL(config-if)#exit
GB-CA-L3S1_DL(config)#interface fastEthernet 0/5
GB-CA-L3S1_DL(config-if)#switchport mode access
GB-CA-L3S1_DL(config-if)#switchport access vlan 36
GB-CA-L3S1_DL(config)#interface range fastEthernet 0/6-24
GB-CA-L3S1_DL(config-if)#switchport mode access
GB-CA-L3S1_DL(config-if)#switchport access vlan 40

//Trunk Configuration
GB-CA-L3S1_DL(config)#interface range gigabitEthernet 0/1-2
GB-CA-L3S1_DL(config-if-range)#switchport mode trunk
GB-CA-L3S1_DL(config-if-range)#switchport trunk native vlan 40
GB-CA-L3S1_DL(config-if-range)#switchport trunk allowed vlan 8-40
GB-CA-L3S1_DL(config-if-range)#switchport nonegotiate




